package util;

/**
 * Число в строку
 */
public class NumberToString {
    static String[] digits = {
            "", "один", "два", "три",
            "четыре", "пять", "шесть", "семь",
            "восемь", "девять", "десять",
            "одиннадцать", "двенадцать",
            "тринадцать", "четырнадцать",
            "пятнадцать", "шестнадцать", "семьнадцать",
            "восемьнадцать", "девятьнадцать",
    };
    String dec[] = {
            "", "", "двадцать", "тридцать",
            "сорок", "пятьдесят", "шестьдесят",
            "семьдесят", "восемьдесят",
            "девяносто"
    };
    String hundreds[] = {
            "", "сто", "двести", "триста", "четыреста", "пятьсот",
            "шестьсот", "семьсот", "восемьсот", "девятьсот",
    };

    /**
     * Число в строку
     */
    public static String intToStr(int N) {
        String res = "";
        if (N == 0)
            res = "ноль";
        if (N > 0)
            res = digits[N];
        res = res.substring(0, 1).toUpperCase() + res.substring(1);
        return res;
    }
}
